# Created by gaojie at 2024-04-28
Feature: 数据字典
  规则管理 -> 基础规则 -> 数据字典模块 相关功能测试用例

  Background:
    Given 进入地址：/
    When 如果跳转到登录页面：${login_url}, 使用用户名：${login}，密码：${password}重新登录
    When 进入模块：规则管理
    And 进入二级菜单：基础规则 下的三级菜单：数据字典
    
  Scenario: 新增数据字典规则
    Given 点击按钮：新增数据字典
    When 输入新增数据字典信息：
      """
        {
          "规则名称": "明朝万达-绩效评定",
          "规则内容配置": [
            {
              "关键字": "不称职",
              "分数": "1"
            },
            {
              "关键字": "需改进",
              "分数": "2"
            },
            {
              "关键字": "略有偏差",
              "分数": "3"
            },
            {
              "关键字": "合格",
              "分数": "4"
            },
            {
              "关键字": "稍超预期",
              "分数": "5"
            },
            {
              "关键字": "良好",
              "分数": "6"
            },
            {
              "关键字": "优先",
              "分数": "7"
            }
          ]
        }
      """
    And 点击【新增数据字典】页面的【确定】按钮
    Then 弹出提示框，显示提示信息：提交成功
    When 选择数据字典：明朝万达-绩效评定，点击操作：查看详情
    Then 数据字典详情中的信息为：
      """
        {
          "规则名称": "明朝万达-绩效评定",
          "规则来源": "自定义",
          "使用状态": "未使用"
        }
      """

  Scenario: 数据字典查询
    When 根据查询条件进行数据字典查询：
      """
        {
          "规则来源": "预置"
        }
      """

  Scenario Outline: 删除数据字典
    When 删除数据字典：<数据字典名称>
    Examples:
      | 数据字典名称     |
      | 明朝万达-绩效评定 |