# Created by gaojie at 2024-04-28
Feature: 关键字/正则模块
  规则管理 -> 基础规则 -> 关键字/正则模块 相关功能测试用例

  Background:
    Given 进入地址：/
    When 如果跳转到登录页面：${login_url}, 使用用户名：${login}，密码：${password}重新登录
    When 进入模块：规则管理
    And 进入二级菜单：基础规则 下的三级菜单：关键字/正则

  Scenario: 新增关键字规则-规则详情中包含中文逗号
    Given 点击按钮：新增规则
    When 输入新增规则信息：
      """
        {
          "规则类型": "关键字",
          "规则名称": "明朝万达-包含中文逗号",
          "规则详情": "明朝，万达"
        }
      """
    And 点击【新增规则】页面的【确认】按钮
    Then 弹出对话提示框，显示提示信息：该关键字规则中包含中文逗号或特殊字符，请确认是否进行提交？
    When 点击【提示】页面的【确定】按钮
    Then 弹出提示框，显示提示信息：提交成功
    When 选择规则：明朝万达-包含中文逗号，点击操作：查看详情
    Then 规则详情中的信息为：
      """
        {
          "规则类型": "关键字",
          "规则名称": "明朝万达-包含中文逗号",
          "规则详情": "明朝，万达",
          "规则来源": "自定义",
          "使用状态": "未使用"
        }
      """

  Scenario: 新增关键字规则-规则详情中包含多个规则
    Given 点击按钮：新增规则
    When 输入新增规则信息：
      """
        {
          "规则类型": "关键字",
          "规则名称": "明朝万达-包含多个规则",
          "规则详情": "明朝万达,wondersoft"
        }
      """
    And 点击【新增规则】页面的【确认】按钮
    Then 弹出提示框，显示提示信息：提交成功
    When 选择规则：明朝万达-包含多个规则，点击操作：查看详情
    Then 规则详情中的信息为：
      """
        {
          "规则类型": "关键字",
          "规则名称": "明朝万达-包含多个规则",
          "规则详情": "明朝万达,wondersoft",
          "规则来源": "自定义",
          "使用状态": "未使用"
        }
      """

  Scenario: 关键字/正则查询
    When 根据查询条件进行关键字/正则查询：
      """
        {
          "规则类型": "关键字"
        }
      """

  Scenario Outline: 删除关键字/正则规则
    When 删除关键字/正则规则：<规则名称>
    Examples:
      | 规则名称            |
      | 明朝万达-包含多个规则 |
      | 明朝万达-包含中文逗号 |