# Created by gaojie at 2024-04-30
Feature: 智能报告管理
  报表中心 -> 管理驾驶舱 -> 智能报告管理 相关功能测试用例

  Background:
    Given 进入地址：/
    When 如果跳转到登录页面：${login_url}, 使用用户名：${login}，密码：${password}重新登录
    When 进入模块：报表中心
    And 进入二级菜单：管理驾驶舱 下的三级菜单：智能报告管理

#  Scenario: 新增快速报告
#    Given 点击按钮：新增报告
#    When 输入新增报告信息：
#      """
#        {
#          "报告名称": "终端全盘扫描-4.29快速报告",
#          "报告类型": "快速报告",
#          "报告格式": "word",
#          "报告模板": "终端全盘扫描",
#          "报告时间范围": {
#            "开始日期": "2024-04-29",
#            "开始时间": "00:00:00",
#            "结束日期": "2024-04-29",
#            "结束时间": "23:59:59"
#          }
#        }
#      """
#    And 点击【新增报告】页面的【确认】按钮
#    Then 弹出提示框，显示提示信息：新增成功

  Scenario: 新增快速报告
    When 新增报告：
      """
        {
          "报告名称": "终端全盘扫描-4.29快速报告",
          "报告类型": "快速报告",
          "报告格式": "word",
          "报告模板": "终端全盘扫描",
          "报告时间范围": {
            "开始日期": "2024-04-29",
            "开始时间": "00:00:00",
            "结束日期": "2024-04-29",
            "结束时间": "23:59:59"
          }
        }
      """

  Scenario: 新增周期报告
    Given 点击按钮：新增报告
    When 输入新增报告信息：
      """
        {
          "报告名称": "终端全盘扫描-周期报告",
          "报告类型": "周期报告",
          "报告周期": "周报",
          "执行时间": "00:00:00",
          "报告格式": "pdf",
          "报告模板": "终端全盘扫描",
          "开启邮件发送": true,
          "通知人邮箱": "gaojie@wondersoft.cn",
          "邮件内容": "各位好：本周终端全盘扫描报告见附件！",
          "邮件主题": "终端全盘扫描报告"
        }
      """
    And 点击【新增报告】页面的【确认】按钮
    Then 弹出提示框，显示提示信息：新增成功

  Scenario: 报告查询
    When 根据查询条件进行报告查询：
      """
        {
          "报告名称": "终端全盘扫描-周期报告",
          "报告模板": "全部"
        }
      """

  Scenario Outline: 删除报告
    When 删除报告：<报告名称>
    Examples:
      | 报告名称 |
      | 终端全盘扫描-4.29快速报告 |
      | 终端全盘扫描-周期报告 |

  Scenario: 删除报告模板
    When 进入二级菜单：管理驾驶舱 下的三级菜单：报告模板管理
    And 删除模板：终端全盘扫描